#include <stdio.h>
#include <math.h>
#include <windows.h>

int xyface[251][251] = { 0 }; //좌표평면을 나타내는 이차원 배열 선언
void callfunc();//그릴 함수의 종류를 받아 해당함수를 부르는 함수 선언
void wlke(double num);//지수함수의 다항식 부분의 값을 처리하는 함수 선언
void drow();//이차원 배열에 저장된 그래프를 출력하는 함수 선언
void make1();//다항함수를 입력받고 이차원 배열에 저장하는 함수 선언
void make2();//지수함수를 입력받고 이차원 배열에 저장하는 함수 선언
void delvalue();//이차원 배열에 저장된 그래프 제거하는 함수 선언

int main() {
	int funnum;//function number을 줄여서 쓴 것으로 그릴 함수의 개수를 뜻함
	printf("그릴 그래프의 개수: ");
	scanf("%d", &funnum);
	Sleep(100);
	system("cls");//콘솔 화면 초기화
	Sleep(100);
	for (int i = 0; i < funnum; i++) {
		callfunc();
	}//함수를 저장하는 함수를 그래프상에 그릴 함수의 개수만큼 호출
	drow();//이차원 배열에 저장된 함수값을 그래프로 찍어내기
	delvalue();//이차원 배열에 저장된 함수값 초기화
	int reen = 0;//뒤의 while문에서 이 프로그램을 다시 시작할지를 판별하는데 사용되는 변수
	while (1) {
		printf("다시 그리길 원한다면 1, 그렇지 않다면 2를 입력해 주세요\n");
		scanf("%d", &reen);
		Sleep(100);
		system("cls");//콘솔창 초기화
		Sleep(100);
		if (reen == 1)
			main();//reen변수가 1이라면 다시 프로그램 시작
		else if (reen == 2) {
			return 0;//reen변수가 2라면 프로그램 끝내기
		}
		else {
			printf("에러입니다.다시 입력하시기 바랍니다.\n");
			printf("■■■■■■■■■■■■     ■■■■■■■■■■       ■■■■■■■■■■         ■■■■■■■■■■       ■■■■■■■■■■    \n");
			printf("■■■■■■■■■■■■     ■■■■■■■■■■       ■■■■■■■■■■         ■■■■■■■■■■       ■■■■■■■■■■    \n");
			printf("■■                         ■■              ■■     ■■              ■■     ■■                ■■     ■■              ■■  \n");
			printf("■■                         ■■              ■■     ■■              ■■     ■■                ■■     ■■              ■■  \n");
			printf("■■                         ■■                ■■   ■■                ■■   ■■                ■■     ■■                ■■\n");
			printf("■■                         ■■                ■■   ■■                ■■   ■■                ■■     ■■                ■■\n");
			printf("■■                         ■■              ■■     ■■              ■■     ■■                ■■     ■■              ■■  \n");
			printf("■■                         ■■              ■■     ■■              ■■     ■■                ■■     ■■              ■■  \n");
			printf("■■■■■■■■■■■■     ■■■■■■■■■■       ■■■■■■■■■■       ■■                ■■     ■■■■■■■■■■    \n");
			printf("■■■■■■■■■■■■     ■■■■■■■■■■       ■■■■■■■■■■       ■■                ■■     ■■■■■■■■■■    \n");
			printf("■■                         ■■              ■■     ■■              ■■     ■■                ■■     ■■              ■■  \n");
			printf("■■                         ■■              ■■     ■■              ■■     ■■                ■■     ■■              ■■  \n");
			printf("■■                         ■■                ■■   ■■                ■■   ■■                ■■     ■■                ■■\n");
			printf("■■                         ■■                ■■   ■■                ■■   ■■                ■■     ■■                ■■\n");
			printf("■■                         ■■                ■■   ■■                ■■   ■■                ■■     ■■                ■■\n");
			printf("■■                         ■■                ■■   ■■                ■■   ■■                ■■     ■■                ■■\n");
			printf("■■■■■■■■■■■■     ■■                ■■   ■■                ■■     ■■■■■■■■■■       ■■                ■■\n");
			printf("■■■■■■■■■■■■     ■■                ■■   ■■                ■■     ■■■■■■■■■■       ■■                ■■\n");
			//ERROR을 콘솔창에 그려넣기
			Sleep(2000);
			system("cls");//콘솔창 2초뒤 초기화
			Sleep(100);
		}
		//1,2이외의 수가 입력되면 에러임을 알리고 다시 입력하도록 함
	}
}

void callfunc() {
	int a;//함수의 종류를 받는 변수 선언
	printf("그릴 함수의 종류(다항함수면 1, 지수함수면 2): ");
	scanf("%d", &a);//함수의 종류를 받기
	Sleep(100);
	system("cls");//콘솔창 초기화
	Sleep(100);
	if (a == 1) {
		make1();//다항함수의 그래프를 이차원배열 상에 저장
	}//1일경우 다항함수를 저장하는 함수 호출
	else if (a == 2) {
		make2();//지수함수의 그래프를 이차원 배열 상에 저장
	}//2일 경우 지수함수를 저장하는 함수 호출
	else {
		printf("에러입니다 다시한번 입력하세요.\n");
		printf("■■■■■■■■■■■■     ■■■■■■■■■■       ■■■■■■■■■■         ■■■■■■■■■■       ■■■■■■■■■■    \n");
		printf("■■■■■■■■■■■■     ■■■■■■■■■■       ■■■■■■■■■■         ■■■■■■■■■■       ■■■■■■■■■■    \n");
		printf("■■                         ■■              ■■     ■■              ■■     ■■                ■■     ■■              ■■  \n");
		printf("■■                         ■■              ■■     ■■              ■■     ■■                ■■     ■■              ■■  \n");
		printf("■■                         ■■                ■■   ■■                ■■   ■■                ■■     ■■                ■■\n");
		printf("■■                         ■■                ■■   ■■                ■■   ■■                ■■     ■■                ■■\n");
		printf("■■                         ■■              ■■     ■■              ■■     ■■                ■■     ■■              ■■  \n");
		printf("■■                         ■■              ■■     ■■              ■■     ■■                ■■     ■■              ■■  \n");
		printf("■■■■■■■■■■■■     ■■■■■■■■■■       ■■■■■■■■■■       ■■                ■■     ■■■■■■■■■■    \n");
		printf("■■■■■■■■■■■■     ■■■■■■■■■■       ■■■■■■■■■■       ■■                ■■     ■■■■■■■■■■    \n");
		printf("■■                         ■■              ■■     ■■              ■■     ■■                ■■     ■■              ■■  \n");
		printf("■■                         ■■              ■■     ■■              ■■     ■■                ■■     ■■              ■■  \n");
		printf("■■                         ■■                ■■   ■■                ■■   ■■                ■■     ■■                ■■\n");
		printf("■■                         ■■                ■■   ■■                ■■   ■■                ■■     ■■                ■■\n");
		printf("■■                         ■■                ■■   ■■                ■■   ■■                ■■     ■■                ■■\n");
		printf("■■                         ■■                ■■   ■■                ■■   ■■                ■■     ■■                ■■\n");
		printf("■■■■■■■■■■■■     ■■                ■■   ■■                ■■     ■■■■■■■■■■       ■■                ■■\n");
		printf("■■■■■■■■■■■■     ■■                ■■   ■■                ■■     ■■■■■■■■■■       ■■                ■■\n");
		//ERROR출력
		Sleep(1000);
		system("cls");//콘솔창 초기화
		callfunc();//다시 함수의 종류 받기
	}//1,2 이외의 수일 경우 에러임을 알리고 함수종류 다시 받기
}

void make1() {
	double rPtn[1000] = { 0 };//다항함수의 계수들을 의미하는 배열
	int rkqt[251] = { 0 };//함숫값을 저장하는 배열
	int cktn = 0;//차수를 저장하는 변수
	printf("다항함수의 차수를 입력하세요: ");
	scanf("%d", &cktn);//차수 입력 받기
	Sleep(100);
	system("cls");//콘솔창 지우기
	Sleep(100);
	printf("다항함수의 계수를 내림차순으로 적어주세요(0도 적어주세요) ");
	for (int i = cktn; i >= 0; i--) {
		printf("\n%d차:", i);
		scanf("%lf", &rPtn[i]);
	}//다항함수의 계수를 내림차순으로 받기(0포함)
	Sleep(100);
	system("cls");//콘솔창 초기화
	Sleep(100);
	for (double i = -12.5; i <= 12.5; i += 0.1) {
		double a = 0;//함숫값을 저장할 변수
		for (int j = cktn; j >= 0; j--) {
			a += rPtn[j] * pow(i, j);
		}//각 항의 값 계산 후 a에 더하기
		if (a <= 12.5 && a >= -12.5) {
			rkqt[(int)round(i * 10) + 125] = (int)(a * 10) + 125;
		}//a가 이 프로그램이 그리는 함수의 영역내에 있는지 확인후 있다면 함숫값 저장 배열에 함숫값을 저장
	}
	for (int j = 0; j <= 250; j++) {
		xyface[j][rkqt[j]] = 1;
	}//위의 시행들을 토대로 함수의 그래프를 2차원 배열에 저장
}

void make2() {
	double alx;//밑을 저장하는 변수
	printf("밑을 입력하세요: ");
	scanf("%lf", &alx);//밑 받기
	Sleep(100);
	system("cls");//콘솔창 초기화
	Sleep(100);
	wlke(alx);//지수부분 처리함수 호출
}

void wlke(double num) {
	double rPtn[1000] = { 0 };//지수부분의 계수를 입력받는 배열
	int rkqt[251] = { 0 };//지수부분의 값 계산을 토대로 함수값을 저장하는 배열
	int cktn = 0;//지수부분의 차수
	printf("지수부분을 이루는 다항식의 차수를 입력하세요: ");
	scanf("%d", &cktn);//차수 입력받기
	Sleep(100);
	system("cls");//콘솔창 초기화
	Sleep(100);
	printf("그 다항식의 계수를 내림차순으로 적어주세요(0도 적어주세요) ");
	for (int i = cktn; i >= 0; i--) {
		printf("\n%d차:", i);
		scanf("%lf", &rPtn[i]);
	}//지수부분의 계수를 내림차순으로 입력받기
	Sleep(100);
	system("cls");// 콘솔창 초기화
	Sleep(100);
	for (double i = -12.5; i <= 12.5; i += 0.1) {
		double a = 0;
		for (int j = cktn; j >= 0; j--) {
			a += rPtn[j] * pow(i, j);
		}//다항함수의 값을 처리하는 것과 동일한 방법으로 지수부분의 값 처리
		if (pow(num, a) <= 12.5 && pow(num, a) >= -12.5) {
			rkqt[(int)round(i * 10) + 125] = (int)round((pow(num, a)) * 10) + 125;
		}//처리한 값을 토대로 그릴 그래프의 부분인지 판별후 그릴 부분이라면 함숫값을 배열에 저장
	}
	for (int j = 0; j <= 250; j++) {
		xyface[j][rkqt[j]] = 1;
	}//위의 시행을 토대로 그래프를 이차원 배열상에 저장
}


void drow() {
	for (int i = 250; i >= 0; i--) {
		for (int j = 0; j <= 250; j++) {
			if (i == 125 || j == 125) {
				printf("*");
			}//x,y축 출력
			else {
				if (xyface[j][i] == 1) {
					printf("*");
				}//함수의 좌표일 경우 별 출력
				else {
					printf(" ");
				}//함수의 좌표가 아닐경우 공백 출력
			}
		}
		printf("\n");// 줄바꿈
	}
}

void delvalue() {
	for (int i = 0; i <= 250; i++) {
		for (int j = 0; j <= 250; j++) {
			xyface[i][j] = 0;
		}
	}// xyface배열 초기화
}